Ran Plan for 7 projects:

1. dir: `infra/us-east-1/prod/eks/green/eks` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/application-secrets` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/grafana-agent` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/kubevela-addons` workspace: `default`
1. dir: `infra/us-east-1/prod/eks/green/eks-addons` workspace: `default`
1. dir: `infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db` workspace: `default`
1. dir: `infra/us-east-1/prod/rds/bastion/ec2-instance` workspace: `default`

### 1. dir: `infra/us-east-1/prod/eks/green/eks` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.eks.aws_eks_addon.this["coredns"] will be updated in-place
!   resource "aws_eks_addon" "this" {
!       addon_version     = "v1.9.3-eksbuild.10" -> "v1.9.3-eksbuild.11"
        id                = "scde-prod-us-east-1-green:coredns"
        tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
!   resource "aws_eks_addon" "this" {
!       addon_version     = "v1.16.0-eksbuild.1" -> "v1.16.2-eksbuild.1"
        id                = "scde-prod-us-east-1-green:vpc-cni"
        tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks_managed_node_group["worker-memory"].aws_eks_node_group.this[0] will be updated in-place
!   resource "aws_eks_node_group" "this" {
        id                     = "scde-prod-us-east-1-green:worker-memory-20231206143720557600000018"
        tags                   = {
            "Name"                                                = "worker-memory"
            "k8s.io/cluster-autoscaler/enabled"                   = "true"
            "k8s.io/cluster-autoscaler/scde-prod-us-east-1-green" = "owned"
        }
        # (16 unchanged attributes hidden)

!       scaling_config {
!           max_size     = 6 -> 9
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_eks_addon.this["coredns"],
│   on .terraform/modules/eks/main.tf line 392, in resource "aws_eks_addon" "this":
│  392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│ 
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
│ 
│ (and 2 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/eks/green/eks`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Feks%252Fgreen%252Feks%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/eks/green/eks`
</details>
Plan: 0 to add, 3 to change, 0 to destroy.

---
### 6. dir: `infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db` workspace: `default`
```diff
Changes to Outputs:
+   db_instance_domain_iam_role_name   = ""

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Frds%252Fprod-marlowe-runtime-benchmark-db%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/rds/prod-marlowe-runtime-benchmark-db`

---
### 7. dir: `infra/us-east-1/prod/rds/bastion/ec2-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
!       ami                                  = "ami-0588935a949f9ff17" -> "ami-046eeba8a7f7bbefd" # forces replacement
!       arn                                  = "arn:aws:ec2:us-east-1:677160962006:instance/i-018ffd73d7ff9a182" -> (known after apply)
!       associate_public_ip_address          = true -> (known after apply)
!       availability_zone                    = "us-east-1a" -> (known after apply)
!       cpu_core_count                       = 1 -> (known after apply)
!       cpu_threads_per_core                 = 1 -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
-       hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
!       id                                   = "i-018ffd73d7ff9a182" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "running" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
!       monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-022335480577e8250" -> (known after apply)
!       private_dns                          = "ip-10-30-13-155.ec2.internal" -> (known after apply)
!       private_ip                           = "10.30.13.155" -> (known after apply)
!       public_dns                           = "ec2-18-232-130-127.compute-1.amazonaws.com" -> (known after apply)
!       public_ip                            = "18.232.130.127" -> (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [] -> (known after apply)
+       spot_instance_request_id             = (known after apply)
!       tags                                 = {
-           "Environment"  = "prod" -> null
            "Name"         = "scde-marlowe-runtime-database-bastion"
-           "Project"      = "scde" -> null
-           "Resource"     = "scde-marlowe-runtime-database-bastion" -> null
-           "Terraform"    = "true" -> null
-           "environment"  = "prod" -> null
-           "function"     = "bastion" -> null
-           "organization" = "iog" -> null
-           "tribe"        = "smart-contracts" -> null
        }
!       tags_all                             = {
-           "Resource"     = "scde-marlowe-runtime-database-bastion" -> null
-           "environment"  = "prod" -> null
-           "function"     = "bastion" -> null
-           "organization" = "iog" -> null
-           "tribe"        = "smart-contracts" -> null
            # (6 unchanged elements hidden)
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
!       vpc_security_group_ids               = [
+           "sg-03a0d7b20aa045f75",
            # (1 unchanged element hidden)
        ]
        # (7 unchanged attributes hidden)

-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 1 -> null
        }

!       credit_specification {
-           cpu_credits = "standard" -> null
        }

!       enclave_options {
!           enabled = false -> (known after apply)
        }

-       maintenance_options {
-           auto_recovery = "default" -> null
        }

!       metadata_options {
!           instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = false -> null
-           enable_resource_name_dns_aaaa_record = false -> null
-           hostname_type                        = "ip-name" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/xvda" -> null
-           encrypted             = false -> null
-           iops                  = 100 -> null
-           tags                  = {} -> null
-           throughput            = 0 -> null
-           volume_id             = "vol-0c4ac8dc4e3ce03a7" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp2" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   ami                                = "ami-0588935a949f9ff17" -> "ami-046eeba8a7f7bbefd"
!   arn                                = "arn:aws:ec2:us-east-1:677160962006:instance/i-018ffd73d7ff9a182" -> (known after apply)
!   capacity_reservation_specification = [
-       {
-           capacity_reservation_preference = "open"
-           capacity_reservation_target     = []
        },
    ] -> (known after apply)
!   ebs_block_device                   = [] -> (known after apply)
!   ephemeral_block_device             = [] -> (known after apply)
!   id                                 = "i-018ffd73d7ff9a182" -> (known after apply)
!   instance_state                     = "running" -> (known after apply)
!   ipv6_addresses                     = [] -> (known after apply)
!   outpost_arn                        = "" -> (known after apply)
!   password_data                      = "" -> (known after apply)
!   primary_network_interface_id       = "eni-022335480577e8250" -> (known after apply)
!   private_dns                        = "ip-10-30-13-155.ec2.internal" -> (known after apply)
!   private_ip                         = "10.30.13.155" -> (known after apply)
!   public_dns                         = "ec2-18-232-130-127.compute-1.amazonaws.com" -> (known after apply)
!   public_ip                          = "18.232.130.127" -> (known after apply)
!   root_block_device                  = [
-       {
-           delete_on_termination = true
-           device_name           = "/dev/xvda"
-           encrypted             = false
-           iops                  = 100
-           kms_key_id            = ""
-           tags                  = {}
-           throughput            = 0
-           volume_id             = "vol-0c4ac8dc4e3ce03a7"
-           volume_size           = 8
-           volume_type           = "gp2"
        },
    ] -> (known after apply)
!   tags_all                           = {
-       Resource     = "scde-marlowe-runtime-database-bastion"
-       environment  = "prod"
-       function     = "bastion"
-       organization = "iog"
-       tribe        = "smart-contracts"
        # (6 unchanged attributes hidden)
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/prod/rds/bastion/ec2-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fprod%252Frds%252Fbastion%252Fec2-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/prod/rds/bastion/ec2-instance`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`